Repository: 84000/data-translation-memory
Catalog: toh558-v1.tmx
Source language: bo
Languages: en

source: ཕ་རོལ་དམག་ཚོགས་ནང་མཆིས་ཏེ། །མཚོན་ཆ་དག་ནི་འབབ་པ་ན། །གནས་རྣམས་ཀུན་ཏུ་བྱུགས་བགྱིས་ན། །བདེ་བླག་ཏུ་ནི་ཐར་བར་འགྱུར། །
en: “When one is in the midst of an enemy army And weapons are falling, It should be smeared on the vital points, And one will easily escape.

source: ལྦ་བ་དང་ནི་གཞང་ནད་དང་། །མེ་དབལ་དང་ནི་འབྲས་བྱུང་དང་། །གདུག་པས་ཟིན་དང་དུག་འཐུངས་པས། །འཐུངས་སམ་བྱུགས་ན་ཐར་བར་འགྱུར། །
en: “When they drink or smear it on, Those with goiters, hemorrhoids, Rashes, or blisters, those with poisonous bites, Or who drank poison will be delivered.

source: ལུས་ལ་དེ་ཡིས་བྱུགས་ན་ནི། །བྱད་སྟེམས་ཐམས་ཅད་གཅོད་པར་བགྱིད། །
en: “Should the body be smeared with it, All kākhorda will be severed.

source: རྩོད་པ་རྣམས་ལས་ཐར་བར་འགྱུར། །རྒྱལ་པོའི་གྱོད་ལས་ཐར་བར་འགྱུར། །མ་གྲུབ་པ་ཡང་གྲུབ་པར་འགྱུར། །དབུལ་པོ་ལས་ནི་ཕྱུག་པོར་འགྱུར། །བུ་མ་མཆིས་པ་བུ་རྙེད་འགྱུར། །ནོར་མ་མཆིས་པ་ནོར་རྙེད་འགྱུར། །
en: “One will be free from all conflicts. One will be delivered from contention with kings. The unsuccessful will be successful. The impoverished will become rich. “People without a son will acquire sons. The poor will gain wealth.

source: རིག་སྔགས་འཆང་གནས་བར་དུ་ཡང་། །འདི་ནི་གསང་སྔགས་གྲུབ་པར་བགྱིད། །
en: One will accomplish the secret mantra For as long as one continues to wear the incantation.

source: དུད་འགྲོའི་སྐྱེ་གནས་གྱུར་པ་དང་། །ལྗོན་ཤིང་རྣམས་ཀྱི་འབྲས་བུ་དང་། །རིག་སྔགས་འཆང་བ་ཐོབ་ལ་ཡང་། །འདི་ནི་ཞི་བའི་ལས་དགེ་བྱེད། །
en: “It produces the auspiciousness of peace For those born as animals, The fruits of trees, Or anything else that bears the incantation.

source: འདི་ལ་གསང་སྔགས་ཚིག་མཆིས་ཏེ། །དཔེར་ན་དབང་པོའི་ཚིག་བཞིན་ནོ། །
en: “Here are the secret mantra syllables, Like the words of Indra:

source: སྱཱད་ཡ་ཐེ་དན། ཨ་ཀྲ་མེ། བི་ཀྲ་མེ། བྷཱུ་ཏ་གྷོ་ཥེ་བྷཱ་ཏཾ་ག་མེ། ད་ཧ་ནི་དྷ་དྷ་རེ། དྷ་ར་བ་རེ། ད་དྷི་ནི། ནི་ཁུ་མེ། ཁུ་ཁུ་མེ། ཁ་ཁ་ཁ་ཁ། སཱ་རཾ་ག་མེ། ཙནྡྲེ ཙ་པ་ལེ། ཧ་ལི་མེ། ཧ་ལེ། ཧཱ་རི་ཎེ་སྭཱ་ཧཱ།
en: syād yathedam akrame vikrame bhūtaghoṣe bhūtaṃgame dahani dhadhare dharavare dadhini nikhume khukhume khakha khakha sāraṃgame candre capale halime hale hāriṇi svāhā |

source: ཕྱོགས་ཐམས་ཅད་ནས་བདག་གི་སྡིག་པ་ཐམས་ཅད་ཞི་བར་གྱུར་ཅིག་སྭཱ་ཧཱ།
en: “May all my misfortunes from every quarter be pacified! Svāhā

source: དེ་ནས་ཚངས་པ་དབང་པོ་དང་། །འཇིག་རྟེན་སྐྱོང་དང་དབང་ཕྱུག་ཆེ། །གནོད་སྦྱིན་སྡེ་དཔོན་ཐམས་ཅད་དང་། །འཕྲོག་མ་བུ་དང་བཅས་པ་ཡང་། །ཐལ་མོ་དག་ནི་རབ་སྦྱར་ནས། །སྒྲ་སྐད་གཅིག་ཏུ་འདི་སྐད་གསོལ། །
en: Then, Brahmā, Indra, The guardians of the world, Maheśvara, All the yakṣa generals, And Hārītī with her sons Joined their palms, And said in one voice:

source: ཉི་མ་སྟོང་ལྟར་གསལ་བ་པོ། །ཟླ་བ་ཉ་ལྟར་འོད་གསལ་བ། །ལྷ་མིར་བཅས་པའི་འཇིག་རྟེན་ན། །ཁྱོད་དང་འདྲ་བ་ཡོང་མ་མཆིས། །
en: “You radiate like a thousand suns. You are as luminous as a full moon. There has never been one like you In this world of gods and men!

source: ལེགས་བསམ་ལེགས་པར་སྦྱར་ན་ནི། །གནོད་སྦྱིན་སྲིན་པོ་རྣམས་འཇོམས་པ། །རྒྱལ་སྲིད་ཐར་བགྱིད་ཅེས་བགྱི་བ། །རིག་སྔགས་རྒྱལ་སྲིད་རབ་སྦྱོར་བ། །སྟོང་ཆེན་གྱི་ནི་འཇིག་རྟེན་ན། །བསྲུང་བའི་མདོ་སྡེ་དམ་པ་ལགས། །
en: “The destroyer of yakṣas and rākṣasas, When well contemplated and well applied, The incantation that guards kingdoms, Called Liberator of Kingdoms, Is the most sublime sūtra for protection In the entire great trichiliocosm.

source: ཕྱག་འཚལ་སྐྱེས་བུ་དཔའ་ཁྱོད་ལ། །ཕྱག་འཚལ་སྐྱེས་བུ་མཆོག་ཁྱོད་ལ། །ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས། །དེ་ཉིད་དུ་ནི་མི་སྣང་གྱུར། །
en: “Homage to you, heroic being! Homage to you, supreme being!” Paying homage with palms joined, They vanished right there.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ནུབ་ཁའི་དུས་ཀྱི་ཚེ། ནང་དུ་ཡང་དག་འཇོག་ལས་བཞེངས་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Then, at dusk, the Blessed One emerged from his meditative composure and said to the monks,

source: དགེ་སློང་དག་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བའི་མདོ་སྡེ་ལོང་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །སྟོན་ཅིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག་དང་།
en: “Monks! Receive, hold, recite, teach, and master the sūtra called Destroyer of the Great Trichiliocosm!

source: དེ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་ཡུན་རིང་པོའི་དོན་དང་། ཕན་པ་དང་། བདེ་བ་དང་། བདེ་བ་ལ་རེག་པར་གནས་པར་འགྱུར་རོ། །
en: It will be for the long-term welfare, benefit, happiness, and comfort of the world with its gods!

source: དགེ་སློང་དག་ངའི་དགེ་སློང་གང་ལ་ལ་ཞིག་གིས་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པའི་མདོ་སྡེ་འདིས་ཤིང་སྐམ་པོ་ལ་སྐུད་པས་བཅིངས་ན་དེ་ལ་ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་རྣམས་སྐྱེ་བར་འགྱུར་ན།
en: “Monks! If any of my monks were to tie a cord to a barren tree with this sūtra, Destroyer of the Great Trichiliocosm , then leaves, flowers, and fruits would grow on it.

source: རྣམ་པར་ཤེས་པ་དང་བཅས་པའི་ལུས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: So it goes without saying what it can do for a body endowed with consciousness

source: སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་མ་གཏོགས་སོ། །
en: —unless, that is, the ripening of prior karma precludes it.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Blessed One had spoken, the monks then asked him,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་མདོ་སྡེ་ཆེན་པོ་ལྔ་གསུངས་པ་དེ་དག་ནི་འདི་ལྟ་སྟེ། སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་དང་། རྨ་བྱ་ཆེན་མོ་དང་། བསིལ་བའི་ཚལ་ཆེན་མོ་དང་། སོ་སོར་འབྲང་བ་ཆེན་མོ་དང་། གསང་སྔགས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཆེན་མོ་ལགས་ཏེ།
en: “The five great sūtras taught by the Venerable Blessed One are Destroyer of the Great Trichiliocosm , Great Peahen , Great Cool Grove , Great Amulet , and Great Application of Secret Mantra

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ཟས་རྣམ་པ་ལྔ་ཡོངས་སུ་སྤངས་ལ་ཆོངས་ཤིག་ཅེས་ཀྱང་བཀའ་སྩལ་ལ།
en: Venerable Blessed One, you have instructed that these sūtras should be upheld by those who refrain from the five kinds of impure food.

source: ཟས་བསོད་སྙོམས་ལ་བརྟེན་ཏེ་རབ་ཏུ་བྱུང་ཤིག་ཅེས་ཀྱང་གསུངས་ན།
en: You have also said that we should take ordination and live on alms.

source: བཅོམ་ལྡན་འདས་ཟས་རྣམ་པ་ལྔ་དང་མ་འདྲེས་པའི་བསོད་སྙོམས་ནི་ཉུང་།
en: However, Blessed One, there are very few alms that are unmixed with the five kinds of impure food.

source: འདི་ལྟར་ཟས་རྣམ་པ་ལྔ་དང་འདྲེས་པ་དེ་ནི་མང་ལགས་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ལ་བདག་ཅག་གིས་ཇི་ལྟར་ནན་ཏན་དུ་བགྱི།
en: In this way, since there are many more that are mixed with the five kinds of impure food, how, Venerable Blessed One, should we conduct ourselves in this regard?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One answered the monks,

source: དགེ་སློང་དག་དེ་ཉིད་ཀྱི་ཕྱིར་སུ་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པའི་མདོ་སྡེ་འདི་འཆང་བ་དེས། རྨ་མེད་པའི་ནོར་བུའི་གཟུངས་ཞེས་བྱ་བ་དེ་བདག་ཉིད་བསྲུང་བར་བྱ་བའི་ཕྱིར་ཆོངས་ཤིག
en: “Monks, it is precisely for this reason that, in order to protect oneself, one who holds the sūtra Destroyer of the Great Trichiliocosm should also hold the Dhāraṇī of the Unblemished Gem

source: དེས་བསོད་སྙོམས་ལེན་པའི་ཚེ་ཟས་ལ་མི་མཐུན་པ་མེད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: In this way one should think of food as being agreeable when taking alms.

source: ཟས་རྣམ་པ་ལྔ་དང་འདྲེས་པའི་བསོད་སྙོམས་ལ་ཡང་ཟས་རྣམ་པ་ལྔ་དང་མ་འདྲེས་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱ།
en: One should even consider food mixed with the five kinds of impure food as being unmixed with the five kinds of impure food.

source: འདུས་བྱས་ཐམས་ཅད་ལ་མི་རྟག་པའི་འདུ་ཤེས་དང་། མི་རྟག་པ་ལ་སྡུག་བསྔལ་བའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་བ་ལ་བདག་མེད་པའི་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: One should also consider all compounded phenomena as impermanent, impermanence as suffering, and suffering as selfless.

source: ཟས་རྣམ་པ་ལྔ་པོ་དག་ག་ལ་ཡོད། ཟས་རྣམ་པ་ལྔ་པོ་སུའི་ཡིན། སུ་ཞིག་ཟས་རྣམ་པ་ལྔ་པོ་ཟ།
en: Where are the five kinds of impure food? Who has the five kinds of impure food? Who eats the five kinds of impure food?

source: སེམས་ཅན་དམིགས་སུ་མེད་དོ། །
en: No sentient being is perceived.

source: དེ་ལ་ཟས་རྣམ་པ་ལྔ་དང་འདྲེས་ན་ཚེས་བརྒྱད་དང་། བཅུ་བཞི་དང་། བཅྭ་ལྔ་ལ་བདག་བསྲུང་བ་བྱས་ཏེ།
en: “If alms are adulterated with the five kinds of impure foods, one should protect oneself on the eighth, fourteenth, and fifteenth lunar days.

source: རྒྱལ་རིགས་ཀྱི་བུ་མོ་ལེགས་པར་བཀྲུས་པ། ཤིན་ཏུ་བརྒྱན་པ། ཉིན་ཞག་གཅིག་ཟས་བཅད་པ། བསླབ་པའི་གནས་ལྔ་བཟུང་བ། སྐུད་པ་དམར་པོ་བཞི་སྒྲིལ་དུ་འཁལ་དུ་བཅུག་ལ་
en: On those days, a girl of royal caste, who has been well cleansed, well adorned, and who has fasted for a day and taken the five precepts, should wind four red strings into a cord.

source: གསང་སྔགས་འཛིན་པས་རིག་སྔགས་དྲན་པར་བྱས་ཏེ་སྐུད་པ་དེ་མདུད་པ་མདུད་ལ།
en: Then, while the incantation is being recollected by a holder of the secret mantra, a knot should be tied in the cord.

source: སྐུད་པ་དེ་མཚོན་སར་པས་བཅད་དེ་བསྲེགས་ལ་
en: Next the cord should be cut with a new knife and burned.

source: རིན་པོ་ཆེའི་སྣོད་དམ། ལྕགས་ཀྱི་སྣོད་ཀྱང་རུང་། ཆུས་ཁོང་སྟེ་མེ་ཏོག་གིས་ཁྱབ་པར་ཁྲོམ་ལ་བདུག་པ་སྣ་ཚོགས་ཀྱིས་བདུགས་ཏེ།
en: Then, the cord should be laid in a jewel or metal vessel filled with water, covered with flowers, and scented with various fragrances.

source: སྣོད་ཀྱི་ནང་ནས་སྐུད་པ་དེ་སླར་འབྱོར་ཏེ་མ་བྱུང་གི་བར་དུ་རིག་སྔགས་འདི་བརྗོད་པར་བྱའོ། །
en: This incantation should then be recited until the cord surfaces inside the vessel.

source: དེ་ཡང་ལག་པ་ལ་བཅིངས་ལ་ཚིག་འདི་སྐད་བརྗོད་དོ། །
en: The cord should then be tied to the wrist and the following should be recited:

source: བྲམ་ཟེ་རྣམས་ཀྱིས་བསླུས་ནས་སུ། །ཤཱཀྱ་སེང་གེའི་སྐྱོབ་པ་ལ། །དཔལ་སྦས་ཀྱིས་ནི་དུག་ཅན་གྱི། །བསོད་སྙོམས་དག་ནི་ཕུལ་བ་དང་། །
en: “ ‘Deceived by his priests, Śrīgupta made an offering Of poisonous alms To the protector, the Lion of the Śākyas.

source: དེ་ལས་དེ་ནི་བླངས་ནས་སུ། །སྟོན་པས་དུག་ནི་བསད་ནས་གསོལ། །
en: “ ‘Accepting it from him, The teacher removed the poison and ate the alms.

source: བདེན་པའི་ཚིག་ནི་འདི་ཡིས་སུ། །ཟས་ནི་བདུད་རྩིར་འགྱུར་བར་ཤོག །
en: Through these words of truth, May food be transformed into ambrosia!

source: རབ་དད་ལྷ་ཡི་དབང་པོ་དང་། །ཚངས་དབང་སུམ་ཅུའི་དབང་ཕྱུག་དང་། །འཇིག་རྟེན་སྐྱོང་བ་བཞི་དག་དང་། །ནོར་བུ་བཟང་དང་དབང་ཕྱུག་ཆེ། །སྲིན་མོ་ནག་མོ་ཆེན་མོ་དང་། །དེ་བཞིན་གདོལ་མ་གཏུམ་མོ་དག
en: “ ‘May Brahmā and Indra— Lord of the gods and sovereign over the realm of the Thirty-Three— The four guardians of the world, Māṇibhadra, Maheśvara, The rākṣasī Mahākālī, And likewise Caṇḍa Caṇḍālinī—

source: རྣམ་པར་གཟིགས་པ་ལྷ་གང་དང་། །གཙུག་ཏོར་ཅན་དང་ཀུན་སྐྱོབ་དང་། །ལོག་པར་དད་པ་སེལ་བ་དང་། །སྟོབས་ཆེན་ལྷ་གང་དད་པ་དང་། །གསེར་དང་དཔལ་ལྡན་འོད་སྲུང་དང་། །ཤཱཀྱ་ཡི་ནི་སེང་གེ་ལ། །
en: “ ‘All with fierce devotion For Vipaśyin in his divinity, Śikhin, Viśvabhū, Krakucchanda, Powerful in his divinity, Kanakamuni, Kāśyapa, And the Lion of the Śākyas—

source: མེ་ཏོག་དང་ནི་བདུག་པ་དང་། །བདག་གི་སྦྱིན་སྲེག་འདི་བཞེས་ཤིག །
en: “ ‘Accept these flowers, fragrances,

source: དེ་དག་ཚིམ་ཞིང་མཆོད་གྱུར་ནས། །བདག་གི་ཁ་ཟས་བྱང་བར་མཛོད། །
en: “ ‘Thus satiated and revered, May they purify my food!

source: ཟས་ལྔ་དག་དང་འདྲེས་པ་ཡང་། །བདག་ལ་མ་འདྲེས་མཛད་དུ་གསོལ། །
en: May they ensure that even food mixed with the five impure foods Is unadulterated for me!

source: ཁ་ཟས་ལྔ་དང་འདྲེས་པ་ཡང་། །ཟས་དེ་ཀུན་ནི་བཟའ་བར་བགྱི། །
en: “ ‘I will eat all the food, Even what is mixed with the five impure foods!

source: ས་བོན་དག་གིས་ཚོགས་ཀུན་ལ། །ས་ཡི་བཅུད་ནི་ཞུགས་པ་ཡི། །ཁ་ཟས་འདྲེས་པ་ཐམས་ཅད་ཀྱང་། །བདག་ལ་མ་འདྲེས་མཛད་དུ་གསོལ། །
en: “ ‘May all adulterated foods From all the collections of seeds Enclosing the essential nutrients of the soil Be unadulterated for me!

source: ཇི་ལྟར་སྐུད་པ་བཅད་བསྲེགས་པ། །དེ་ལྟ་བུ་ཡང་སླར་འབྱོར་པ། །
en: “ ‘Just as the cord, cut and burned, Was restored once more,

source: དེ་ལྟར་ཟས་རྣམས་འདྲེས་པ་ཡང་། །མ་འདྲེས་པར་ཡང་བདག་ལ་མཛོད། །
en: May adulterated foods likewise Be made unadulterated for me!

source: སྱཱད་ཡ་ཐེ་དན། ཁ་ཁ་མེ། ཁ་ཁ་ཁ་ཁ། ཁུ་ཁུ་མེ། ཤི་མེ་ཤི་མེ། ཤི་ཧུ་མེ། ཤི་མེ། ཤི་མེ། སྭ་སྟི་སྭ་སྟི་སྭ་སྟི་སྭ་སྟི། མ་མ་ཤཱནྟེ། ཤཱ་རཱ་གྲེ
en: syād yathedam khakhame khakha khakha khukhume śime śime śihume śime śime svasti svasti svasti svasti mama śānte sārāgre |

source: ཁ་ཟས་ལྔ་དང་འདྲེས་པ་ཡང་། །ཇི་ལྟར་མ་འདྲེས་ཟས་བཞིན་དུ། །གང་གིས་ཇི་ལྟར་སྐུད་བསྲེགས་པ། །དེ་འདྲའི་བདེན་པ་མཛད་དུ་གསོལ། །
en: “ ‘Just as what is mixed with the five impure foods Is eaten without being adulterated— Just like the burned cord— May this truth manifest!

source: སྱཱད་ཡ་ཐེ་དན། ཀ་ལ་ཀེ། ཀལ་ལེ། བ་ལ་ནི། ཀ་རུ་ཏ། ཨཱ་ལ་ཡེ། ཨགླེ། སཾ་ཀྲཱ་མ་ཎེ་སྭཱ་ཧཱ།
en: syād yathedam kalake kalale balani karuḍa ālāye agne saṃkrāmane svāhā |

source: སངས་རྒྱས་རྣམ་པར་གཟིགས་དང་གཙུག་ཏོར་ཅན། །བདེ་གཤེགས་ཀུན་སྐྱོབ་སངས་རྒྱས་ལོག་པར་དད་སེལ་དང་། །གསེར་ཐུབ་འོད་སྲུང་ཤཱཀྱ་ཐུབ་པ་གཽ་ཏ་མ། །བསྙེངས་པ་མི་མངའ་བ་ལ་སྐྱབས་སུ་མཆི་བར་བགྱི། །
en: “ ‘I go for refuge to Buddha Vipaśyin, Śikhin, The Thus-Gone One Viśvabhū, Krakucchanda, Kanakamuni, Kāśyapa, And fearless Gautama!

source: མི་མཆོག་བདུན་པོ་དེ་དག་གི་ནི་སྐུ་རྣམས་ལ། །མེ་ཏོག་དག་དང་སྤོས་རྣམས་ཀྱིས་ནི་མཆོད་པར་བགྱི། །
en: “ ‘I worship the bodies of those seven supreme humans With flowers and fragrances!

source: ལུས་དང་ངག་དང་རབ་ཏུ་དང་བའི་སེམས་ཀྱིས་ནི། །དེ་དག་རྣམས་ལ་སྐྱབས་སུ་ཉེ་བར་མཆི་བར་བགྱི། །
en: With body, speech, and devout mind, I go to them for refuge!

source: སངས་རྒྱས་རྫུ་འཕྲུལ་ཆེ་དང་ལྡན་པ་དེ་དག་ལ། །ལྷ་གང་མངོན་པར་རབ་ཏུ་དང་བ་ཡོད་པ་ཡི། །ལྷ་དེ་མགུ་ཞིང་ཡིད་ནི་རབ་ཏུ་དགར་གྱུར་ནས། །རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་བདག་ལ་བསྲུང་དུ་གསོལ། །
en: “ ‘May the gods who have special devotion For those buddhas replete with supernatural powers Be elated and joyous, And with devout minds protect me!’ ”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དགེ་སློང་དེ་དག་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: At these words from the Blessed One, the monks rejoiced, and praised what the Blessed One had said.

source: འཕགས་པ་སྟོང་ཆེན་པོ་རབ་ཏུ་འཇོམས་པ་ཞེས་བྱ་བའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the sūtra entitled “ Destroyer of the Great Trichiliocosm

source: རྒྱ་གར་གྱི་མཁན་པོ་ཤཱི་ལེནྡྲ་བོ་དྷི་དང་། ཛྙཱ་ན་སིདྡྷི་དང་། ཤཱཀྱ་པྲ་བྷ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: This was translated and edited by the Indian preceptors Śīlendrabodhi, Jñānasiddhi, and Śākyaprabha, along with the translator-editor Bandé Yeshé Dé who edited and finalized the translation.

source: སླར་ཡང་ལོ་ཙཱ་བ་གཞོན་ནུ་དཔལ་གྱིས་ཆོས་རྗེ་ཆག་ལོའི་རྒྱ་དཔེ་དང་བསྟུན་ནས་ཞུ་དག་པར་བགྱིས་སོ།།
en: Later still, the translator Zhönnu Pal edited it by comparing it with the Sanskrit edition that had been in the possession of Chojé Chaglo.
